/* Вывести на экран "Hello world!" */

#include <stdio.h> // Подключаем библиотеку ввода-вывода

int main(void)
{
    printf("Hello World!\n");
    return 0; // Завершает программу с кодом 0, что все хорошо
}