/* Вывести на экран текст "лесенкой" */

#include<stdio.h>

int main(void)
{
    printf("\nLet's\n");
    printf("\tgo\n");
    printf("\t\tto wolk\n\n");
    return 0;
}